### Name: Emon Abdul Awal(艾沂蒙)
### ID: 188801232
### Class: Sofware Engineering
### Subject: Data Analysis

Take a look at the DataFrames changes.

Suppose there is a DataFrame here,

  name    pay
 #### 0 Mayue 3000
 #### 1  Lilin   4500
 #### 2  Wuyun   80001

 Add a tax column into aDF.

In [41]:
import numpy as np
import pandas as pd
aDF = np.array([['','Name','Pay'],
                ['0','Mayue','3000'],
                ['1','Lilin','4500'],
                ['2','Wuyun','80001'],
                ])
                
print(pd.DataFrame(data=aDF[1:,1:],
                  index=aDF[1:,0],
                  columns=aDF[0,1:]))

    Name    Pay
0  Mayue   3000
1  Lilin   4500
2  Wuyun  80001

1. Add a tax column into aDF.

In [42]:
aDF=(pd.DataFrame(data=aDF[1:,1:],
                  index=aDF[1:,0],
                  columns=aDF[0,1:]))
# Use `.index`
aDF['Tax'] =['0.05','0.05', '0.1']

# Print `df`
print(aDF)

    Name    Pay   Tax
0  Mayue   3000  0.05
1  Lilin   4500  0.05
2  Wuyun  80001   0.1

2. Add rows

We can use loc or iloc to do data selection operation by label or integer index. 
The append() method and concat() function are also ok.

In [43]:
aDF.loc[5] = {'Name': 'Liuxi', 'Pay': 5000, 'Tax': 0.05}

In [44]:
aDF

    Name    Pay   Tax
0  Mayue   3000  0.05
1  Lilin   4500  0.05
2  Wuyun  80001   0.1
5  Liuxi   5000  0.05

3. delete data

The del operation can actually delete the data. 
The drop() method is safer than the del operation 
because it can return a new object instead of changing the original DataFrames.

Drop the row which label is 5,

In [45]:
aDF.drop(5)

    Name    Pay   Tax
0  Mayue   3000  0.05
1  Lilin   4500  0.05
2  Wuyun  80001   0.1


Drop the tax column,

In [46]:

aDF.drop('Tax', axis = 1)

    Name    Pay
0  Mayue   3000
1  Lilin   4500
2  Wuyun  80001
5  Liuxi   5000

In [47]:
aDF

    Name    Pay   Tax
0  Mayue   3000  0.05
1  Lilin   4500  0.05
2  Wuyun  80001   0.1
5  Liuxi   5000  0.05


4. Modify

Modify the column,

In [48]:
aDF['Tax'] = 0.03
aDF

    Name    Pay   Tax
0  Mayue   3000  0.03
1  Lilin   4500  0.03
2  Wuyun  80001  0.03
5  Liuxi   5000  0.03

Modify the row,

In [49]:
aDF.loc[5] = ['Liuxi', 9800, 0.05]

In [50]:
aDF

    Name    Pay   Tax
0  Mayue   3000  0.03
1  Lilin   4500  0.03
2  Wuyun  80001  0.03
5  Liuxi   9800  0.05